<template>
  <v-main>
    <v-container>
      <v-row>
        <v-col>
          <h1>Тестовое задание SquareGPS</h1>
          <p>
            Необходимо с помощью Vuejs, Vuex, VueRouter, Vuetify написать
            приложение. Хэдер приложения должен содержать меню из 2-х пунктов: О
            задании и Карта. В основной части приложения должно отображаться
            содержимое разделов.
          </p>
          <h2>Раздел "О задании"</h2>
          <p>
            В разделе должен быть текст этого задания, сверстанный аналогично.
          </p>
          <h2>Раздел "Карта"</h2>
          <p>На экране должны быть карта и список (см. пример):</p>
          <ol>
            <li>
              При клике на кнопку добавления, карта должна перейти в режим
              добавления маркера: в месте клика должен появится маркер, а в
              списке - запись с адресом точки.
              <ol type="a">
                <li>
                  Для поиска адреса можно использовать любое бесплатное API для
                  геокодирования, например: https://geocode.maps.co/.
                </li>
                <li>
                  В случае, если адрес не найден, необходимо вывести ошибку и не
                  добавлять маркер в список.
                </li>
              </ol>
            </li>
            <li>При клике на маркер должна подсвечиваться запись в списке.</li>
            <li>
              При клике на запись в списке карта должна центрироваться на
              маркере.
            </li>
            <li>
              Маркеры должны храниться локально и не пропадать после
              перезагрузки страницы.
            </li>
            <li>
              В адресной строке должен отображаться id выбранного маркера.
            </li>
          </ol>
          <p>
            Локальное хранение данных должно быть организовано в виде сервиса,
            эмулирующего бекенд. (Необходим класс Backend, который
            псевдо-асинхронно сохраняет данные в localStorage)
          </p>
          <p><b>Дополнительно:</b></p>
          <ol>
            <li>Продумать отображение на мобильных устройствах.</li>
            <li>Предусмотреть локализацию.</li>
            <li>
              Необходимо с помощью <b>jest</b> написть 1 модульный тест на любой
              компонент.
            </li>
          </ol>
          <p>
            <b>Напоминание</b>: тестовое задание призвано показать умение писать
            хороший модульный код, а также умение пользоваться указанными
            технологиями и не только. Этим кодом нужно гордиться.
          </p>
          <p>Пример:</p>
          <v-container>
            <v-img
              :width="400"
              aspect-ratio="4/3"
              cover
              src="map-example.png"
            ></v-img>
          </v-container>
        </v-col>
      </v-row>
    </v-container>
  </v-main>
</template>

<style>
ol li {
  margin-bottom: 0.5rem;
  padding-top: 0.5rem;
}
</style>
